## Read JSON files

In [1]:
import pandas as pd
pd.read_json('train.json').sample(2)
# some common parameters of read_json() from read_csv() studied earlier :-
# dtypes, convert_dates, encoding, chunksize, nrows

          id      cuisine                                        ingredients
2816    3722      italian  [frozen chopped spinach, large eggs, 1% low-fa...
14555  26297  southern_us  [dark corn syrup, vanilla extract, pecan halve...

In [2]:
# Read from URL
pd.read_json('https://api.exchangerate-api.com/v4/latest/INR').sample(2)

,provider,WARNING_UPGRADE_TO_V6,terms,base,date,time_last_updated,rates
VND,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-07-28,1753660801,299.75
RSD,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-07-28,1753660801,1.15

## Read database files

In [ ]:
# Open XAMPP control panel and start apache and MySQL
# Go to http://localhost/phpmyadmin/
# Click new db,then enter a name for your db & then import your sql file to load the db

In [3]:
# This library Connects python to mySQL DB
import mysql.connector

# Specifiying the mySQL DB
conn = mysql.connector.connect(host='localhost', user='root', password='', database='world')

In [4]:
# Display city table from world database
pd.read_sql_query("select * from city", conn).sample(2)

        ID    Name CountryCode      District  Population
124    125  Tandil         ARG  Buenos Aires       91101
1998  1999  Siping         CHN         Jilin      317223

In [5]:
# Applying sql queries :-
pd.read_sql_query("select * from city where CountryCode like 'IND'", conn).sample(2)

       ID                Name CountryCode       District  Population
111  1135             Mathura         IND  Uttar Pradesh      226691
2    1026  Calcutta [Kolkata]         IND   West Bengali     4399819

In [8]:
pd.read_sql_query("select * from country where LifeExpectancy > 60", conn).sample(2)

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
45,ESP,Spain,Europe,Southern Europe,505992.0,1492.0,39441700,78.8,553233.0,532031.0,España,Constitutional Monarchy,Juan Carlos I,653,ES
92,MAR,Morocco,Africa,Northern Africa,446550.0,1956.0,28351000,69.1,36124.0,33514.0,Al-Maghrib,Constitutional Monarchy,Mohammed VI,2486,MA

In [ ]:
# some common parameters of read_sql_query() from read_csv() studied earlier :-
# index_col, parse_dates, chunksize